app/views/bookings/_form.html.erb

SELECT "rooms".* FROM "rooms"
---
    <%= form.label :room_id, "Room", style: "display: block" %>
    <%= form.collection_select :room_id, Room.all, :id, :name, prompt: "Select a room" %>