app/controllers/bookings_controller.rb

  def index
    @bookings = Booking.all
---
SELECT "bookings".* FROM "bookings"

  def create
    @booking = Booking.new(booking_params)
    @booking.user = current_user

    if @booking.save
---
INSERT INTO "bookings" ("starts_at", "ends_at", "note", "room_id", "user_id", "created_at", "updated_at") VALUES ('2025-12-14 18:55:00', '2025-12-15 22:00:00', '', 6, 1, '2025-12-14 18:56:12.142282', '2025-12-14 18:56:12.142282') RETURNING "id"

  def destroy
    @booking.destroy!
---
DELETE FROM "bookings" WHERE "bookings"."id" = 1

    def set_booking
      @booking = Booking.find(params[:id])
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = 1 LIMIT 1