app/controllers/rooms_controller.rb

SELECT "rooms".* FROM "rooms"
---
  def index
    @rooms = Room.all

INSERT INTO "rooms" ("name", "capacity", "created_at", "updated_at") VALUES ('Room A', 2, '2025-12-14 18:55:26.877654', '2025-12-14 18:55:26.877654') RETURNING "id"
---
  def create
    @room = Room.new(room_params)

    respond_to do |format|
      if @room.save

UPDATE "rooms" SET "capacity" = $1, "name" = $2, "updated_at" = $3 WHERE "rooms"."id" = $4  [["capacity", 15], ["name", "Room Updated"], ["updated_at", "2025-12-16 00:46:17.665193"], ["id", 63]]
---
  def update
    respond_to do |format|
      if @room.update(room_params)

DELETE FROM "rooms" WHERE "rooms"."id" = 5
---
  def destroy
    @room.destroy!

SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = 5 LIMIT 1
---
    def set_room
      @room = Room.find(params.expect(:id))