app/models/booking.rb

  def no_overlap
    return if starts_at.blank? || ends_at.blank? || room_id.blank?

    overlap = Booking
      .where(room_id: room_id)
      .where.not(id: id)
      .where("starts_at < ? AND ends_at > ?", ends_at, starts_at)
      .exists?
---
SELECT 1 AS one FROM "bookings" WHERE "bookings"."room_id" = 7 AND "bookings"."id" IS NOT NULL AND (starts_at < '2025-12-17 21:14:00' AND ends_at > '2025-12-14 21:14:00') LIMIT 1